web/scripts/k6-stress-30s.txt
time="2026-07-13T17:08:39-04:00" level=warning msg="\"cli\" level configuration overrode scenarios configuration entirely"

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: web/scripts/k6-stress.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 200 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 200 VUs  01.0s/30s

running (0m02.0s), 200/200 VUs, 1 complete and 0 interrupted iterations
default   [   7% ] 200 VUs  02.0s/30s

running (0m03.0s), 200/200 VUs, 72 complete and 0 interrupted iterations
default   [  10% ] 200 VUs  03.0s/30s

running (0m04.0s), 200/200 VUs, 190 complete and 0 interrupted iterations
default   [  13% ] 200 VUs  04.0s/30s

running (0m05.0s), 200/200 VUs, 300 complete and 0 interrupted iterations
default   [  17% ] 200 VUs  05.0s/30s

running (0m06.0s), 200/200 VUs, 392 complete and 0 interrupted iterations
default   [  20% ] 200 VUs  06.0s/30s

running (0m07.0s), 200/200 VUs, 499 complete and 0 interrupted iterations
default   [  23% ] 200 VUs  07.0s/30s

running (0m08.0s), 200/200 VUs, 591 complete and 0 interrupted iterations
default   [  27% ] 200 VUs  08.0s/30s

running (0m09.0s), 200/200 VUs, 691 complete and 0 interrupted iterations
default   [  30% ] 200 VUs  09.0s/30s

running (0m10.0s), 200/200 VUs, 778 complete and 0 interrupted iterations
default   [  33% ] 200 VUs  10.0s/30s

running (0m11.0s), 200/200 VUs, 874 complete and 0 interrupted iterations
default   [  37% ] 200 VUs  11.0s/30s

running (0m12.0s), 200/200 VUs, 949 complete and 0 interrupted iterations
default   [  40% ] 200 VUs  12.0s/30s

running (0m13.0s), 200/200 VUs, 1040 complete and 0 interrupted iterations
default   [  43% ] 200 VUs  13.0s/30s

running (0m14.0s), 200/200 VUs, 1127 complete and 0 interrupted iterations
default   [  47% ] 200 VUs  14.0s/30s

running (0m15.0s), 200/200 VUs, 1199 complete and 0 interrupted iterations
default   [  50% ] 200 VUs  15.0s/30s

running (0m16.0s), 200/200 VUs, 1279 complete and 0 interrupted iterations
default   [  53% ] 200 VUs  16.0s/30s

running (0m17.0s), 200/200 VUs, 1366 complete and 0 interrupted iterations
default   [  57% ] 200 VUs  17.0s/30s

running (0m18.0s), 200/200 VUs, 1452 complete and 0 interrupted iterations
default   [  60% ] 200 VUs  18.0s/30s

running (0m19.0s), 200/200 VUs, 1542 complete and 0 interrupted iterations
default   [  63% ] 200 VUs  19.0s/30s

running (0m20.0s), 200/200 VUs, 1629 complete and 0 interrupted iterations
default   [  67% ] 200 VUs  20.0s/30s

running (0m21.0s), 200/200 VUs, 1710 complete and 0 interrupted iterations
default   [  70% ] 200 VUs  21.0s/30s

running (0m22.0s), 200/200 VUs, 1793 complete and 0 interrupted iterations
default   [  73% ] 200 VUs  22.0s/30s

running (0m23.0s), 200/200 VUs, 1891 complete and 0 interrupted iterations
default   [  77% ] 200 VUs  23.0s/30s

running (0m24.0s), 200/200 VUs, 1960 complete and 0 interrupted iterations
default   [  80% ] 200 VUs  24.0s/30s

running (0m25.0s), 200/200 VUs, 2024 complete and 0 interrupted iterations
default   [  83% ] 200 VUs  25.0s/30s

running (0m26.0s), 200/200 VUs, 2121 complete and 0 interrupted iterations
default   [  87% ] 200 VUs  26.0s/30s

running (0m27.0s), 200/200 VUs, 2198 complete and 0 interrupted iterations
default   [  90% ] 200 VUs  27.0s/30s

running (0m28.0s), 200/200 VUs, 2255 complete and 0 interrupted iterations
default   [  93% ] 200 VUs  28.0s/30s

running (0m29.0s), 200/200 VUs, 2299 complete and 0 interrupted iterations
default   [  97% ] 200 VUs  29.0s/30s

running (0m30.0s), 200/200 VUs, 2385 complete and 0 interrupted iterations
default   [ 100% ] 200 VUs  30.0s/30s

running (0m31.0s), 121/200 VUs, 2465 complete and 0 interrupted iterations
default ↓ [ 100% ] 200 VUs  30s

running (0m32.0s), 044/200 VUs, 2542 complete and 0 interrupted iterations
default ↓ [ 100% ] 200 VUs  30s


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.05' rate=0.11%

    http_req_duration
    ✓ 'p(95)<3000' p(95)=2.47s
    ✓ 'p(99)<8000' p(99)=2.87s

    http_req_failed
    ✓ 'rate<0.05' rate=0.11%


  █ TOTAL RESULTS 

    checks_total.......: 4792   146.809426/s
    checks_succeeded...: 99.87% 4786 out of 4792
    checks_failed......: 0.12%  6 out of 4792

    ✓ board 200
    ✓ home 200
    ✓ board has activities
    ✓ health 200
    ✓ storage writable
    ✗ join 200
      ↳  97% — ✓ 132 / ✗ 3
    ✗ join has entry
      ↳  97% — ✓ 132 / ✗ 3

    CUSTOM
    board_ms.......................: avg=1579.039944 min=746.382  med=1542.495 max=5013.696 p(90)=2110.0938 p(95)=2445.6054
    errors.........................: 0.11%  3 out of 2586
    join_ms........................: avg=2261.230096 min=1226.794 med=2064.98  max=6651.959 p(90)=2894.4066 p(95)=3234.6541

    HTTP
    http_req_duration..............: avg=1.63s       min=746.38ms med=1.58s    max=6.65s    p(90)=2.17s     p(95)=2.47s    
      { expected_response:true }...: avg=1.63s       min=746.38ms med=1.58s    max=6.65s    p(90)=2.16s     p(95)=2.46s    
    http_req_failed................: 0.11%  3 out of 2586
    http_reqs......................: 2586   79.225621/s

    EXECUTION
    iteration_duration.............: avg=2.41s       min=1.26s    med=2.35s    max=7.35s    p(90)=3.05s     p(95)=3.32s    
    iterations.....................: 2586   79.225621/s
    vus............................: 44     min=44        max=200
    vus_max........................: 200    min=200       max=200

    NETWORK
    data_received..................: 97 MB  3.0 MB/s
    data_sent......................: 922 kB 28 kB/s



running (0m32.6s), 000/200 VUs, 2586 complete and 0 interrupted iterations
default ✓ [ 100% ] 200 VUs  30s